Revit 2027 API
SolidUtils.IsValidForTessellation Method
 Tests if the input solid or shell is valid for tessellation.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool IsValidForTessellation(
	Solid solidOrShell
)
Public Shared Function IsValidForTessellation (
	solidOrShell As Solid
) As Boolean
public:
static bool IsValidForTessellation(
	Solid^ solidOrShell
)
static member IsValidForTessellation :
        solidOrShell : Solid -> bool
Parameters
solidOrShell Solid
 The solid or shell.
Return Value
Boolean
 True if the solid or shell is valid for tessellation, false otherwise.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
SolidUtils Class
Autodesk.Revit.DB Namespace